`s.isnull` 

`df.sort_index` 

`df.sort_values` 

`df.transpose()` or `df.T` 

`df.expanding` 

`df.rolling` 

`df.pct_change` 

`df.diff` 

`df.groupby` 

`df.loc` 

`s.iloc` 

`df.dropna` 

`s.isunique` 

`df.join` 

`df.merge` 

`df.corr` 

`s.to_frame` 

`s.removesuffix` 

`s.removeprefix` 

`s.title` 

`pd.concat` 

`df.assign` 

`DataFrame-GroupBy.agg` 


`DataFrame-GroupBy.filter` 

    - Keeps those rows whose group results in `True` from an outside function  
    - df.groupby('a').filter(filter_func)

`DataFrame-GroupBy.transform` 

    - Modifiles those rows based on an outside function  
    - df.groupby('a').transform(transform_func)


`df.rename` 

    - Renames columns in a data frame  
    - df.rename(columns={'a':'b', 'c':'d'})

`df.drop_duplicates` 

    - Returns a data frame whose rows contain distinct values  
    - sample: df.drop_duplicates()


`df.drop` 

    - Removes rows or columns from a data frame, returning a new one  
    - sample: df.drop('a', axis = 'columns')

In [1]:
import pandas as pd
import numpy as np

Load the CSV file nyc_taxi_2019-01.csv into a data frame using only the columns passenger_count, trip_distance, and total_amount.

In [2]:
filepath = r"C:\Users\dqthi\Downloads\pandas-workout-data\data\nyc_taxi_2019-01.csv"

ex = pd.read_csv(filepath, usecols=['passenger_count', 'trip_distance', 'total_amount'])

In [4]:
ex.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7667792 entries, 0 to 7667791
Data columns (total 3 columns):
 #   Column           Dtype
---  ------           -----
 0   passenger_count  int64
 1   trip_distance    float64
 2   total_amount     float64
dtypes: float64(2), int64(1)
memory usage: 175.5 MB

In [5]:
ex.head(5)

   passenger_count  trip_distance  total_amount
0                1            1.5          9.95
1                1            2.6         16.30
2                3            0.0          5.80
3                5            0.0          7.55
4                5            0.0         55.55

In [ ]:
# this information seems quite large, as there are 7.6million records and memory consumption was 175.bmb

Using a descending sort, find the average cost of the 20 longest (in distance) taxi rides in January 2019.

In [ ]:
(
    ex
    .sort_values('trip_distance', ascending=False)
    ['total_amount']
    .iloc[:20]
    .mean()
    .round(2))

290.01

Using an ascending sort, find the average cost of the 20 longest (in distance) taxi rides in January 2019. Are the results any different?

In [25]:
(
    ex
    .sort_values('trip_distance')
    ['total_amount']
    .iloc[-20:]
    .mean()
    .round(2)
)

290.01

Sort by ascending passenger count and descending trip distance. (So, start with the longest trip with 0 passengers and end with the shortest trip with 9 passengers.) What is the average price paid for the top 50 rides?

In [26]:
(
    ex
    .sort_values(['passenger_count', 'trip_distance'],
                 ascending=[True,False])  
    ['total_amount']
    .iloc[:50]
    .mean()
    .round(2)
)

135.5

In which five rides did people pay the most per mile? How far did people go on those trips?

In [48]:
ex['amount_p_distance'] = ex['total_amount'] / ex['trip_distance']

In [49]:
ex

,passenger_count,trip_distance,total_amount,amount_p_passenger,amount_p_distance
0,1,1.50,9.95,9.950000,6.633333
1,1,2.60,16.30,16.300000,6.269231
2,3,0.00,5.80,1.933333,inf
3,5,0.00,7.55,1.510000,inf
4,5,0.00,55.55,11.110000,inf
...,...,...,...,...,...
7667787,1,4.79,23.16,23.160000,4.835073
7667788,1,0.00,0.00,0.000000,NaN
7667789,1,0.00,0.00,0.000000,NaN
7667790,1,0.00,0.00,0.000000,NaN
7667791,1,0.00,0.00,0.000000,NaN

In [ ]:
ex.sort_values('amount_p_distance', ascending=False, ignore_index=True,)['trip_distance'].iloc[0:5]

0    0.0
1    0.0
2    0.0
3    0.0
4    0.0
Name: trip_distance, dtype: float64

In [59]:
ex_b = ex.dropna(subset='amount_p_distance')

In [61]:
ex_c = ex.replace(np.inf, np.nan )

In [ ]:
ex_c.dropna(subset='amount_p_distance')

,passenger_count,trip_distance,total_amount,amount_p_passenger,amount_p_distance
0,1,1.50,9.95,9.95,6.633333
1,1,2.60,16.30,16.30,6.269231
7,1,1.30,9.05,9.05,6.961538
8,1,3.70,18.50,18.50,5.000000
9,2,2.10,13.00,6.50,6.190476
...,...,...,...,...,...
7667783,2,4.15,15.80,7.90,3.807229
7667784,1,1.34,9.30,9.30,6.940299
7667785,1,1.45,14.16,14.16,9.765517
7667786,2,4.28,21.96,10.98,5.130841
7667787,1,4.79,23.16,23.16,4.835073

In [64]:
ex_c.sort_values('amount_p_distance', ascending=False, ignore_index=True).iloc[0:5]

,passenger_count,trip_distance,total_amount,amount_p_passenger,amount_p_distance
0,1,2.40,623261.66,623261.660,259692.358333
1,1,0.10,6667.45,6667.450,66674.500000
2,4,0.01,415.30,103.825,41530.000000
3,1,0.01,322.30,322.300,32230.000000
4,1,0.01,273.96,273.960,27396.000000

Let’s assume that multipassenger rides are split evenly among the passengers. Given that assumption, in which 10 multipassenger rides did each individual pay the greatest amount?

In [32]:
ex['amount_p_passenger'] = ex['total_amount'] / ex['passenger_count']

In [42]:
ex[ex['passenger_count'] == 9].sort_values('amount_p_passenger', ascending=False, ignore_index=True)

   passenger_count  trip_distance  total_amount  amount_p_passenger
0                9           0.00        110.76           12.306667
1                9          13.38         90.80           10.088889
2                9           0.00         12.74            1.415556
3                9           0.00         12.60            1.400000
4                9           0.00         12.25            1.361111
5                9           0.00         11.30            1.255556
6                9           0.00         10.30            1.144444
7                9           0.00          9.80            1.088889
8                9           0.00          9.30            1.033333

In the exercise solution, I showed that we needed to use iloc or head/tail to retrieve the first/last 20 rows because the index was scrambled after our sort operation. But you can pass ignore_index=True to sort_values: then the resulting data frame has a numeric index starting at 0. Use this option and loc to get the mean total_amount for the 20 longest trips.

In [31]:
(
    ex
    .sort_values('trip_distance', ascending=False, ignore_index=True)
    ['total_amount']
    .iloc[:20]
    .sum()
    .round(2)
)

5800.2